//********************************************************************
//
//      KEY Init Initialization Part
//      4DClass
//      Copyright(C)  2017
//      All rights reserved
//***********************************************************************
#include "MyInclude.h"


/*******************************************************************************
 * 函数名：interrupt ISR
 * 描述  ：中断函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：内部调用
 ******************************************************************************/
void interrupt ISR(void)
{
    if(TMR2IE&&TMR2IF) {
    }
}
/*******************************************************************************
 * 函数名：Timer2_Init
 * 描述  ：系定时器2初始化函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：内部调用
 ******************************************************************************/
void Timer2_Init(void)
{
    //T2CON
    TOUTPS0=0;
    TOUTPS1=0;
    TOUTPS2=0;
    TOUTPS3=0;//设置输出后分频比1~16
    T2CKPS0=1;
    T2CKPS1=0;//时钟预分频比00=1 01=4 1x=16

    TMR2=0;//定时器2计数器付初值
    PR2=12;//定时器2周期比较寄存器 PR2的值要大于TMR2  T=(1/16MHz)*16*4*25 = 0.1ms

    //INTCON
    PEIE=1;//外设中断使能 1=enble 0=disable
    TMR2IE=1;//TMR2与PR2比较相等中断使能位 1=enable 0=disable
    TMR2IF=0;//TMR2与PR2比较相等中断标志位 硬件置1，软件清0
    GIE=1; //全局中断使能 1=enble 0=disable
    TMR2ON=1;//打开定时器2使能位
}

